# Parker McQuade
## 4/18/2023 - 4/20/2023
## Py - Dataframe processing

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
# values counts 
df = DataFrame({'Q1': [10,30,40,30,40],
               'Q2': [20,30,10,20,30],
               'Q3': [10,50,20,40,40]},
              index = list('abcde'))
df

   Q1  Q2  Q3
a  10  20  10
b  30  30  50
c  40  10  20
d  30  20  40
e  40  30  40

In [3]:
df.values

array([[10, 20, 10],
       [30, 30, 50],
       [40, 10, 20],
       [30, 20, 40],
       [40, 30, 40]], dtype=int64)

In [5]:
df['Q1'].value_counts()

30    2
40    2
10    1
Name: Q1, dtype: int64

In [6]:
df['Q3'].value_counts()

40    2
20    1
10    1
50    1
Name: Q3, dtype: int64

In [7]:
df.loc['d'].value_counts()

30    1
40    1
20    1
Name: d, dtype: int64

In [9]:
df.apply(pd.value_counts)

     Q1   Q2   Q3
10  1.0  1.0  1.0
20  NaN  2.0  1.0
30  2.0  2.0  NaN
40  2.0  NaN  2.0
50  NaN  NaN  1.0

In [10]:
df.apply(pd.value_counts).fillna(0)

     Q1   Q2   Q3
10  1.0  1.0  1.0
20  0.0  2.0  1.0
30  2.0  2.0  0.0
40  2.0  0.0  2.0
50  0.0  0.0  1.0

In [11]:
df.apply(pd.value_counts).fillna(0).astype('int')

    Q1  Q2  Q3
10   1   1   1
20   0   2   1
30   2   2   0
40   2   0   2
50   0   0   1

In [12]:
rs = df.apply(pd.value_counts).fillna(0).astype('int')
rs

    Q1  Q2  Q3
10   1   1   1
20   0   2   1
30   2   2   0
40   2   0   2
50   0   0   1

In [13]:
rs.index.name = 'values'
rs

        Q1  Q2  Q3
values
10       1   1   1
20       0   2   1
30       2   2   0
40       2   0   2
50       0   0   1

In [14]:
rs.columns.name='questions'

In [15]:
rs

questions  Q1  Q2  Q3
values
10          1   1   1
20          0   2   1
30          2   2   0
40          2   0   2
50          0   0   1